#!/usr/local/env python3
# -*- coding: utf-8 -*-

from datetime import datetime

#-------------------------------------------------------------------------------------------------------------------------
# 获取当前/指定日期和时间
#-------------------------------------------------------------------------------------------------------------------------
print(datetime.now())# date and time

dt = datetime(2019,10,29, 12, 20,30) # year/mon/day hour/min/second
print(dt)

#-------------------------------------------------------------------------------------------------------------------------
# datetime转换为timestamp
#-------------------------------------------------------------------------------------------------------------------------

print(dt.timestamp()) #注意Python的timestamp是一个浮点数。如果有小数位，小数位表示毫秒数。

print(datetime.fromtimestamp(12345))
print(datetime.utcfromtimestamp(12345)) # UTC时间 GMT0

#-------------------------------------------------------------------------------------------------------------------------
# datetime string 
#-------------------------------------------------------------------------------------------------------------------------

#https://docs.python.org/3/library/datetime.html#strftime-strptime-behavior
print(datetime.now().strftime('%a,%b %d %H:%M:%S'))
print(datetime.now().strftime('%y,%m %d %H:%M:%S'))
print(datetime.strptime('2015-6-1 18:19:59', '%Y-%m-%d %H:%M:%S'))

#-------------------------------------------------------------------------------------------------------------------------
# datetime加减
#-------------------------------------------------------------------------------------------------------------------------

#datetime oper 
#对日期和时间进行加减实际上就是把datetime往后或往前计算，得到新的datetime。加减可以直接用+和-运算符，不过需要导入timedelta这个类

from datetime import timedelta

print(datetime.now() + timedelta(days=1, hours=1))

#-------------------------------------------------------------------------------------------------------------------------
# 本地时间转换为UTC时间
#-------------------------------------------------------------------------------------------------------------------------

from datetime import timezone

tz_utc8 = timezone(timedelta(hours=8))

now = datetime.now()
print(now)

now2 = now.replace(tzinfo=tz_utc8)
print(now2)


#-------------------------------------------------------------------------------------------------------------------------
# 时区转换
#-------------------------------------------------------------------------------------------------------------------------
#我们可以先通过utcnow()拿到当前的UTC时间，再转换为任意时区的时间：
utc_time = datetime.utcnow()
print(utc_time)
bj_time = utc_time.replace(tzinfo=timezone(timedelta(hours=8)))
print(bj_time)

#注：不是必须从UTC+0:00时区转换到其他时区，任何带时区的datetime都可以正确转换，例如上述bj_dt到tokyo_dt的转换。
tokoyo_time = bj_time.astimezone(timezone(timedelta(hours=9)))

